pellepl/baremetal/arch/msp/msp430/mdk/include/cc430f6145.h
/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FLASH__ 0x0140
#define FLASH_BASE             __MSP430_BASEADDRESS_FLASH__

sfr_w(FCTL1);                                 /* FLASH Control 1 */
sfr_b(FCTL1_L);                               /* FLASH Control 1 */
sfr_b(FCTL1_H);                               /* FLASH Control 1 */
//sfrbw    FCTL2                  (0x0142)  /* FLASH Control 2 */
sfr_w(FCTL3);                                 /* FLASH Control 3 */
sfr_b(FCTL3_L);                               /* FLASH Control 3 */
sfr_b(FCTL3_H);                               /* FLASH Control 3 */
sfr_w(FCTL4);                                 /* FLASH Control 4 */
sfr_b(FCTL4_L);                               /* FLASH Control 4 */
sfr_b(FCTL4_H);                               /* FLASH Control 4 */

#define FRPW                   (0x9600)       /* Flash password returned by read */
#define FWPW                   (0xA500)       /* Flash password for write */
#define FXPW                   (0x3300)       /* for use with XOR instruction */
#define FRKEY                  (0x9600)       /* (legacy definition) Flash key returned by read */
#define FWKEY                  (0xA500)       /* (legacy definition) Flash key for write */
#define FXKEY                  (0x3300)       /* (legacy definition) for use with XOR instruction */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE                  (0x0002)       /* Enable bit for Flash segment erase */
#define MERAS                  (0x0004)       /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT                   (0x0020)       /* Smart Write enable */
#define WRT                    (0x0040)       /* Enable bit for Flash write */
#define BLKWRT                 (0x0080)       /* Enable bit for Flash segment write */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE_L                (0x0002)       /* Enable bit for Flash segment erase */
#define MERAS_L                (0x0004)       /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT_L                 (0x0020)       /* Smart Write enable */
#define WRT_L                  (0x0040)       /* Enable bit for Flash write */
#define BLKWRT_L               (0x0080)       /* Enable bit for Flash segment write */

/* FCTL3 Control Bits */
#define BUSY                   (0x0001)       /* Flash busy: 1 */
#define KEYV                   (0x0002)       /* Flash Key violation flag */
#define ACCVIFG                (0x0004)       /* Flash Access violation flag */
#define WAIT                   (0x0008)       /* Wait flag for segment write */
#define LOCK                   (0x0010)       /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                   (0x0020)       /* Flash Emergency Exit */
#define LOCKA                  (0x0040)       /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */

/* FCTL3 Control Bits */
#define BUSY_L                 (0x0001)       /* Flash busy: 1 */
#define KEYV_L                 (0x0002)       /* Flash Key violation flag */
#define ACCVIFG_L              (0x0004)       /* Flash Access violation flag */
#define WAIT_L                 (0x0008)       /* Wait flag for segment write */
#define LOCK_L                 (0x0010)       /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX_L                 (0x0020)       /* Flash Emergency Exit */
#define LOCKA_L                (0x0040)       /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */

/* FCTL4 Control Bits */
#define VPE                    (0x0001)       /* Voltage Changed during Program Error Flag */
#define MGR0                   (0x0010)       /* Marginal read 0 mode. */
#define MGR1                   (0x0020)       /* Marginal read 1 mode. */
#define LOCKINFO               (0x0080)       /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */

/* FCTL4 Control Bits */
#define VPE_L                  (0x0001)       /* Voltage Changed during Program Error Flag */
#define MGR0_L                 (0x0010)       /* Marginal read 0 mode. */
#define MGR1_L                 (0x0020)       /* Marginal read 1 mode. */
#define LOCKINFO_L             (0x0080)       /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */

/************************************************************
* LCD_B
************************************************************/
#define __MSP430_HAS_LCD_B__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_LCD_B__ 0x0A00
#define LCD_B_BASE             __MSP430_BASEADDRESS_LCD_B__

sfr_w(LCDBCTL0);                              /* LCD_B Control Register 0 */
sfr_b(LCDBCTL0_L);                            /* LCD_B Control Register 0 */
sfr_b(LCDBCTL0_H);                            /* LCD_B Control Register 0 */
sfr_w(LCDBCTL1);                              /* LCD_B Control Register 1 */
sfr_b(LCDBCTL1_L);                            /* LCD_B Control Register 1 */
sfr_b(LCDBCTL1_H);                            /* LCD_B Control Register 1 */
sfr_w(LCDBBLKCTL);                            /* LCD_B blinking control register */
sfr_b(LCDBBLKCTL_L);                          /* LCD_B blinking control register */
sfr_b(LCDBBLKCTL_H);                          /* LCD_B blinking control register */
sfr_w(LCDBMEMCTL);                            /* LCD_B memory control register */
sfr_b(LCDBMEMCTL_L);                          /* LCD_B memory control register */
sfr_b(LCDBMEMCTL_H);                          /* LCD_B memory control register */
sfr_w(LCDBVCTL);                              /* LCD_B Voltage Control Register */
sfr_b(LCDBVCTL_L);                            /* LCD_B Voltage Control Register */
sfr_b(LCDBVCTL_H);                            /* LCD_B Voltage Control Register */
sfr_w(LCDBPCTL0);                             /* LCD_B Port Control Register 0 */
sfr_b(LCDBPCTL0_L);                           /* LCD_B Port Control Register 0 */
sfr_b(LCDBPCTL0_H);                           /* LCD_B Port Control Register 0 */
sfr_w(LCDBPCTL1);                             /* LCD_B Port Control Register 1 */
sfr_b(LCDBPCTL1_L);                           /* LCD_B Port Control Register 1 */
sfr_b(LCDBPCTL1_H);                           /* LCD_B Port Control Register 1 */
sfr_w(LCDBPCTL2);                             /* LCD_B Port Control Register 2 */
sfr_b(LCDBPCTL2_L);                           /* LCD_B Port Control Register 2 */
sfr_b(LCDBPCTL2_H);                           /* LCD_B Port Control Register 2 */
sfr_w(LCDBPCTL3);                             /* LCD_B Port Control Register 3 */
sfr_b(LCDBPCTL3_L);                           /* LCD_B Port Control Register 3 */
sfr_b(LCDBPCTL3_H);                           /* LCD_B Port Control Register 3 */
sfr_w(LCDBCPCTL);                             /* LCD_B Charge Pump Control Register 3 */
sfr_b(LCDBCPCTL_L);                           /* LCD_B Charge Pump Control Register 3 */
sfr_b(LCDBCPCTL_H);                           /* LCD_B Charge Pump Control Register 3 */
sfr_w(LCDBIV);                                /* LCD_B Interrupt Vector Register */

